
import css from "../HomePage/HomePage.module.css";


export default function HomePage() {
  
 
  return (
    <div className={css.homeCont}>
      <h1 className={css.title}>Ласкаво просимо до PhoneBook!</h1>
      <p className={css.titleDescr}>
        PhoneBook - це веб-додаток, призначений для зберігання контактної
        інформації користувачів. Додаток надає можливість реєстрації та
        авторизації, забезпечуючи безпечний доступ до особистої адресної книги
        кожного користувача. PhoneBook спрощує керування контактами,
        дозволяючи зберігати та організовувати інформацію про друзів, сім'ю,
        колег та інші важливі контакти.
      </p>
      <ul className={css.listDescr}>
        <h3 >Основні функції:</h3>
        <li>
          <strong>1. Реєстрація користувачів:</strong>
          <p>
            - Створення нового облікового запису за допомогою email та пароля.
          </p>
          <p>- Підтвердження email для забезпечення безпеки.</p>
        </li>
        <li>
          <strong>2. Логін користувачів:</strong>
          <p>- Авторизація за допомогою email та пароля.</p>
        </li>
        <li>
          <strong>3. Менеджмент контактів:</strong>
          <p>- Додавання нового контакту з ім'ям, номером телефону.</p>
          <p>- Видалення контактів, які більше не потрібні.</p>
        </li>
        <li>
          <strong>4. Пошук та фільтрація контактів:</strong>
          <p>- Швидкий пошук контактів за ім'ям або номером телефону.</p>
        </li>
        <li>
          <strong>5. Безпека та конфіденційність:</strong>
          <p>- Зберігання даних у зашифрованому вигляді.</p>
          <p>- Використання SSL/TLS для захисту даних при передачі.</p>
        </li>
        <li>
          <strong>6. Користувацький інтерфейс:</strong>
          <p>
            - Інтуїтивно зрозумілий та зручний інтерфейс для легкого керування
            контактами.
          </p>
        </li>
      </ul>
    </div>
  );
}
